<script setup>

</script>

<template>
  <div class="page">

    <h2>仕様関連</h2>

    <h3>ポケモン一覧で2条件以上でソートしたい</h3>
    <p>
      シフト押しながらクリックすると2条件でソートできます。
    </p>

    <h3>入れ替えとか削除でいちいち再計算入るのどうにかならない？</h3>
    <p>
      どうにかしたいとは思っています。
    </p>

    <h3>厳選評価の仕組みは？</h3>
    <p>
      最終進化のポケモンについて全サブスキル・全せいかくの組み合わせにおける1日のエナジー期待値を計算し、その順位を基準に評価しています。<br>
      まずは他に影響を与えないスキルを持ったポケモンを計算し、それぞれの厳選度上位(デフォルト90%)の期待値エナジーを集計し、更に優秀な種族の上位50%を元にサポート系スキルを持ったポケモンの評価をします。
      <br>
      きのみ：カビゴンの好きなきのみ前提<br>
      食材：設定により基礎エナジ～最良の料理×最大レシピレベル<br>
      通常スキル<br>
      ・エナジーチャージ：そのまま<br>
      ・食材ゲット：上記食材と同等の評価<br>
      ・ゆめのかけらゲット：効果量×設定のゆめのかけらゲット評価値<br>
      ・料理パワーアップ：(最良の料理 - 通常のなべで作れる最良の料理) / 鍋サイズの差分 ×効果量<br>
      ・料理チャンス：1週間編成し続け、最良の料理×最大レシピレベルを作り続けた際の増分を7日で割った値<br>
      サポート系スキル<br>
      ・おてつだいサポート/おてつだいブースト：上位50％の平均お手伝いエナジー×効果量<br>
      ・げんきエール/げんきオール：(げんき回復あり - げんき回復なし)×上位50％の平均日給エナジー
    </p>

    <h3>厳選設定でゆめのかけらゲット評価のデフォルト値が30の理由は？</h3>
    <p>
      「120エナジー/日＝約28ゆめのかけら/週＝約4ゆめのかけら/日」<br>
      となるため、1ゆめのかけらは30エナジー相当としています。<br>
      そのためスキルレベル7になるとエナジー換算で54,000エナジーほどで評価されるぶっ壊れになりますが、ゆめのかけらゲットを編成する時はゆめのかけら最優先の時だと思うので問題ないと思われます。<br>
      ポケモン一覧でのスコア表示や、チーム用のシミュレーションの際はゆめのかけらの評価度を設定できるので、30%程度にしておけば他ポケモンと同等の評価がされます。
    </p>

    <h3>ラルトスの進化先に問答無用でエルレイドが表示されるんだけど</h3>
    <p>
      それだけのために性別の入力欄作るの面倒だったので許してください。
    </p>

    <h3>今後予定している機能は？</h3>
    <p>
      ・日曜に食材等の準備をするパターンのシミュレーション<br>
      ・料理ごとのレシピレベル設定(今は一律最大値固定)<br>
      ・指定レベル/最終進化になった仮定でシミュレーションして誰を育成すべきか判断できるやつ<br>
      ・任意のポケモンをチーム編成に固定する機能
    </p>
    

    <h2>技術関連</h2>

    <h3>もっと処理速くならない？</h3>
    <p>
      <a href="https://github.com/reimer0204/pokesle-simulator" target="_blank">GitHub</a>でソースコード公開してるので助けてください。プルリク歓迎です。
    </p>
    
    <h3>要望出したいんだけど</h3>
    <p>
      <a href="https://x.com/harezora_lueur" target="_blank">@harezora_lueur</a>とか<a href="https://github.com/reimer0204/pokesle-simulator" target="_blank">GitHub</a>とかに連絡ください。自分も欲しい機能なら作ります。
    </p>

  </div>
</template>

<style lang="scss" scoped>
.page {
  padding: 20px;

  h2 {
    font-size: 24px;
    line-height: 1.4;
    margin-bottom: 0.5em;

    border-bottom: 2px #CCC solid;

    &:not(:first-of-type) {
      margin-top: 1em;
    }
  }
  h3 {
    font-size: 18px;
    line-height: 1.4;
    margin-bottom: 0.25em;
    border-bottom: 2px #CCC solid;
  }
  p {
    padding: 5px 0;
  }
}
</style>