<template>
  <div class="page">

    <h2>更新履歴</h2>

    <h3>2024/08/11</h3>
    <ul>
      <li>厳選テーブルのバージョンが古い場合、厳選情報を表示しないよう改善</li>
      <li>ポケモン情報編集時に、ボックスの厳選の状況を追加</li>
      <li>一部列でソートしようとするとエラーが出る不具合を修正</li>
    </ul>

    <h3>2024/07/31</h3>
    <ul>
      <li>ボックスでの概算スコア計算時、ヒーラーの期待計算に不備があったため修正</li>
      <li>睡眠時間がスプレッドシート連携の対象から外れている問題を修正</li>
    </ul>

    <h3>2024/07/30</h3>
    <ul>
      <li>
        シミュレーションの設定で料理を選択可能に変更
        <ul>
          <li>カンストしている料理を避けつつ極力エナジーを稼ぐ計算などに使えます</li>
        </ul>
      </li>
      <li>
        ヒーラーの計算にスキルストックを反映
        <ul>
          <li>深層学習がうまくできておらず、スキルストックがなかった時より高いですが本来より若干低めに出てそうです。</li>
        </ul>
      </li>
      <li>厳選テーブル作成の設定におやすみリボンの時間を追加</li>
      <li>所持ポケモンの設定におやすみリボンの時間を追加</li>
      <li>日別シミュレーションに料理の回数設定を追加</li>
      <li>各種チームシミュレーションで伝説ポケモンを2匹以上組み込む編成が出ないよう改善</li>
    </ul>


    <h3>2024/07/21</h3>
    <ul>
      <li>
        げんき計算を重回帰分析から深層学習に変更
        <ul>
          <li>ちょっと重くなっちゃったかもしれないけど精度がかなり上がりました(誤差が従来に比べて90%減)</li>
          <li>睡眠時間が短い場合の計算もより正確になりました</li>
          <li>睡眠時間/チェック頻度による各々の計算が不要になったので、厳選テーブルの再計算は設定タブで行うことにしました</li>
        </ul>
      </li>
      <li>厳選テーブルタブをやめてデータタブにし、食材・料理・ポケモンの情報を掲載</li>
      <li>厳選テーブル生成時、食材ゲットSが高く評価されすぎないよう設定値を追加</li>
    </ul>

    <h3>2024/07/16</h3>
    <ul>
      <li>新規ポケモン9匹の情報を追加</li>
      <li>ローマ字入力の対応に漏れがあったので追加</li>
    </ul>

    <h3>2024/07/13</h3>
    <ul>
      <li>イベントボーナスの適用がタイプ指定しかできなかったので「全員」を追加</li>
    </ul>

    <h3>2024/07/11</h3>
    <ul>
      <li>料理のレシピを最新のものに更新(これに伴い食材の価値が変わったため要再計算)</li>
    </ul>

    <h3>2024/07/09</h3>
    <ul>
      <li>げんきの計算を最新版のものに修正</li>
      <li>指定レベル・最終進化を仮定してシミュレーションできる設定をボックスに追加</li>
    </ul>

    <h3>2024/07/06</h3>
    <ul>
      <li>週末準備用のシミュレーション機能を追加(まだベータ版です)</li>
    </ul>
    
    <h3>2024/07/05</h3>
    <ul>
      <li>チームシミュレーションの際、おてつだいサポート、おてつだいブーストで得られるきのみの評価にきのみ率ではなく食材率が使用されていた不具合を修正</li>
      <li>週間シミュレーションのスコアの表示を改善</li>
    </ul>
    
    <h3>2024/06/26</h3>
    <ul>
      <li>ボックス画面でチームシミュレーションの対象とするか、必須でいれるかの設定を追加</li>
    </ul>

    <h3>2024/06/25</h3>
    <ul>
      <li>一部ポケモンのバランス調整を反映していなかったので修正</li>
      <li>データ更新があった場合、更新を促す表示を追加</li>
      <li>
        入力データの食材に不備があった場合にポケモン一覧がローディング状態となり修正もできなくなる問題を修正
        <ul>
          <li>他のところではまだエラー出るかも</li>
        </ul>
      </li>
      <li>入力データの食材に不備がある場合、ポケモン一覧で強調表示される機能を追加</li>
    </ul>

    <h3>2024/06/23</h3>
    <ul>
      <li>とりあえず公開</li>
    </ul>

  </div>
</template>

<style lang="scss" scoped>
.page {
  padding: 20px;

  h2 {
    font-size: 24px;
    line-height: 1.4;
    margin-bottom: 0.5em;

    border-bottom: 2px #CCC solid;

    &:not(:first-of-type) {
      margin-top: 1em;
    }
  }
  h3 {
    font-size: 18px;
    line-height: 1.4;
    margin: 0.5em 0 0.25em 0;
    border-bottom: 2px #CCC solid;
  }
  p {
    padding: 5px 0;
  }
}
</style>