<script setup>
import Version from '../models/version';
import config from '../models/config';

config.version.history = Version.HISTORY;
</script>

<template>
  <div class="page">

    <div class="senden">
      ポケスリシミュは広告や寄付等による収益化は一切行っていません。<br>
      もし応援していただける方がいらっしゃいましたら、作者の他の活動についてチャンネル登録やフォロー等いただけるとげんきが回復するのでよろしくお願いします🙇‍♂️<br>
      <div class="flex-row flex-wrap gap-1em mt-5px">
        <a href="https://www.youtube.com/@harezora_lueur" target="_blank">YouTube</a>
        <a href="https://x.com/hrzr_lueur_vrc"            target="_blank">X(メイン)</a>
        <a href="https://x.com/hiyashi_exit"              target="_blank">X(サブ1)</a>
        <a href="https://x.com/reimer0204"                target="_blank">X(サブ2)</a>
        <a href="https://misskey.io/@harezora_lueur"      target="_blank">misskey.io(避難用)</a>
        
      </div>
    </div>

    <h2 class="mt-1em">更新履歴</h2>
    
    <h3>2026/1/18</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>ボックス画面の概算エナジー計算時に除外/固定を考慮して計算するよう改善</li>
          <li>ボックスサマリーの食材、スキルのページの表示を改善</li>
        </ul>
      </li>
    </ul>
    
    <h3>2026/1/11</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>ボックスサマリーにフィールド別の表示を追加</li>
        </ul>
      </li>
    </ul>
    
    <h3>2026/1/3</h3>
    <ul>
      <li>
        不具合修正
        <ul>
          <li>ポケモン新規登録時のみ、入力した睡眠時間が保存されない不具合を修正</li>
        </ul>
      </li>
    </ul>
    
    <h3>2026/1/2</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>仮置きしていたほっぺすりすりの計算を実装</li>
          <li>厳選情報生成時、スキルコピー、ほっぺすりすり共にエナジー換算値を設定できるよう改善</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/12/28</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>
            タマザラシ(ホリデー)、トゲデマル、アルクジラ、ハルクジラ追加
            <ul>
              <li>ほっぺすりすりでメインスキル発動可能ボーナスが得られる確率などが不明なので、現時点ではげんきエール分の効果のみでの計算となります</li>
            </ul>
          </li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/12/04</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>
            デリバードのアップデート反映、ミカルゲの追加
            <ul>
              <li>プレゼント(食材ゲットS)はアメをエナジー換算するのが難しかったので一旦アメは無いものとしました</li>
            </ul>
          </li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/11/13</h3>
    <ul>
      <li>
        不具合修正
        <ul>
          <li>厳選情報のリセットを忘れていたため対応</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/11/09</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>アンバー渓谷と新ポケモンを追加</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/11/03</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>バケッチャ、パンプジン、イーブイ(ハロウィン)を追加</li>
          <li>ずっしりカボチャと新しい料理を追加</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/10/21</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>Ver.3.0.0の変更を反映</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/10/11</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>ネイティ、ネイティオの追加を忘れていたので対応</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/09/27</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>イベントボーナスにきのみの数の設定を追加</li>
          <li>スキルごとの倍率の設定を追加
            <ul>
              <li>食材ゲットSのみ倍率を設定できる欄がありましたが、こちらは削除されたので今後は上記の機能をご利用ください</li>
            </ul>
          </li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/09/23</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>
            ボックスサマリーのページに機能追加
            <ul>
              <li>食材構成ごとの表示はかなり重いのでフリーズにご注意ください</li>
            </ul>
          </li>
        </ul>
      </li>
      <li>
        不具合修正
        <ul>
          <li>データページの食材・スキルの計算が正常にできなくなっていた問題を修正</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/09/06</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>イベントボーナスの対象を複数選べるよう改善</li>
          <li>厳選詳細ポップアップの食材エナジーの計算式をよりわかりやすい表示に改善</li>
          <li>ミミッキュとウォーグルのスキル確率の変更を反映</li>
        </ul>
      </li>
      <li>
        不具合修正
        <ul>
          <li>全体的に食材エナジーの評価が高めに出ている不具合を修正</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/08/30</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>8/7のバランス調整(ガラガラ、ダグトリオ、おてつだいサポートS)を反映</li>
        </ul>
      </li>
      <li>
        不具合修正
        <ul>
          <li>ボックスサマリーにダークライが表示されない不具合を修正</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/08/23</h3>
    <ul>
      <li>
        機能改善
        <ul>
          <li>シミュレーションに現在の料理パワーアップの値を追加</li>
          <li>チームシミュ時のチーム条件に任意のタイプを編成するための条件を追加</li>
          <li>EXモードの食材ボーナスの確率を仮置きの30%から50%に修正</li>
        </ul>
      </li>
      <li>
        不具合修正
        <ul>
          <li>ポケモンを連続で登録する際、メモ欄がクリアされない問題を修正</li>
          <li>オールとくいがイベントボーナスを受けない問題を修正</li>
          <li>ダークライがいるとキーワード検索でエラーが発生する問題を修正</li>
        </ul>
      </li>
    </ul>
    
    <h3>2025/08/16</h3>
    <ul>
      <li>
        前回の修正で厳選情報生成のメモリ使用量が増大したため、速度の代わりにメモリ使用量を削減
      </li>
    </ul>
    
    <h3>2025/08/16</h3>
    <ul>
      <li>げんきチャージのポケモンの厳選情報に誤差が出る問題を修正</li>
      <li>ヒーラー系のポケモンの厳選度0%付近の値がおかしくなる問題を修正</li>
    </ul>
    
    <h3>2025/08/14</h3>
    <ul>
      <li>TSVインポート、スプレッドシートのインポート時にダークライが不完全なデータとして弾かれる問題を修正</li>
      <li>ポケモンの追加、編集時に追加先のNoを指定できるよう改善</li>
    </ul>
    
    <h3>2025/08/12</h3>
    <ul>
      <li>新規登録時にメモが保存されない不具合を修正</li>
    </ul>

    <h3>2025/08/11</h3>
    <ul>
      <li>フィールド設定にEXモードを追加</li>
      <li>
        エレズン、ストリンダーを追加
        <ul>
          <li>せいかくによる分岐は現在未対応です</li>
        </ul>
      </li>
      <li>ボックス画面にキーワード検索を追加</li>
      <li>ボックス画面の表示設定に「メモ」を追加</li>
      <li>
        厳選情報でとくい以外の厳選度も評価できるよう改善
        <ul>
          <li>一部きのみとくい、食材とくいに強力なスキルがつき始めたので参考情報として出すようにしました</li>
        </ul>
      </li>
      <li>厳選情報の保存先をより安定する場所に変更</li>
    </ul>

    <h3>2025/07/28</h3>
    <ul>
      <li>厳選計算で料理パワーアップSが過小評価されていた問題を修正</li>
    </ul>

    <h3>2025/07/27</h3>
    <ul>
      <li>チームシミュレーション時、料理パワーアップSの効果により鍋が10000ほど拡張されていた問題を修正</li>
    </ul>

    <h3>2025/07/20</h3>
    <ul>
      <li>ボックスにまっしろミントの計算を追加</li>
    </ul>

    <h3>2025/07/19</h3>
    <ul>
      <li>キモリ、アチャモ、ミズゴロウ、プラスル、マイナンを追加</li>
      <li>ポケモン登録時、厳選情報の最大値が更新されていかない問題の改善</li>
      <li>ポケモン除外設定で特定のスキルを持つポケモンの除外設定が効いていなかった問題を修正</li>
      <li>概算時の料理パワーアップの評価方法を改善</li>
    </ul>

    <h3>2025/07/12</h3>
    <ul>
      <li>スキルレベルを指定したポケモンの育成仮定で進化させた場合もスキルレベルが上がるよう改善</li>
      <li>ハガネールの所持数が誤っていたため修正</li>
      <li>アメによる経験値増加量変更アップデートの反映</li>
      <li>食材準備に当日食材の有無を追加</li>
    </ul>

    <h3>2025/06/23</h3>
    <ul>
      <li>いあいぎりすき焼きカレーとカモネギを追加</li>
    </ul>

    <h3>2025/06/14</h3>
    <ul>
      <li>クチート追加</li>
    </ul>

    <h3>2025/06/07</h3>
    <ul>
      <li>一部ポケモンのステータス変更を反映</li>
      <li>シミュレーションの設定をいくつか追加</li>
    </ul>

    <h3>2025/06/01</h3>
    <ul>
      <li>厳選情報の内訳でスキルとくいでも天井が78と表示されている問題を修正(厳選、シミュレーション自体は正常でした)</li>
    </ul>

    <h3>2025/06/01</h3>
    <ul>
      <li>昨日の改修でとくい問わず第1食材が2個になっていた不具合を修正</li>
    </ul>

    <h3>2025/05/31</h3>
    <ul>
      <li>ダークライを正しく登録できるよう改善</li>
      <li>ヤミカラス、ドンカラス追加</li>
      <li>
        食材準備ページ追加
        <ul>
          <li>最初に料理度外視のチームをシミュレーションし、そのメンバーが持ってくる食材を加味しながら何を何個用意しておけば良いか計算できるページです。</li>
        </ul>
      </li>
    </ul>

    <h3>2025/05/14</h3>
    <ul>
      <li>チームシミュレーション実行時、ヒーラー以外のげんきが誤った計算になることがある問題を修正</li>
    </ul>

    <h3>2025/05/06</h3>
    <ul>
      <li>ピンプク、ラッキー、ハピナスを追加</li>
      <li>はなふぶきミモザサラダのエナジー修正を反映</li>
    </ul>

    <h3>2025/05/01</h3>
    <ul>
      <li>
        サラダの追加レシピを反映
        <ul>
          <li>合わせて一部食材の価値が向上したため厳選テーブルの再計算が必要になります。</li>
        </ul>
      </li>
    </ul>

    <h3>2025/04/29</h3>
    <ul>
      <li>
        チームシミュの対象数を種類ごとに設定できるよう変更
        <ul>
          <li>今まで最終的なスコアの上位n匹でしたが、ヒーラーが上位を占めすぎる問題があったため、ヒーラー以外を対象とできるよう細分化しました。</li>
          <li>従来の形式で分析する場合は総合スコアだけに数値を入れて、他を0にしてください。</li>
        </ul>
      </li>
      <li>ボックスのサポート関連のスコア計算をエナジーとゆめのかけらに分割し、分かりやすく変更</li>
      <li>
        料理パワーアップの評価の概算値を変更
        <ul>
          <li>ボックスでのスコア概算時は理論値で計算する都合上、なべの隙間はおいしいシッポを詰める想定で計算していましたが、あまりにも非現実的なので隙間は全食材の平均エナジーで埋めるものとして変更しました。</li>
          <li>また、4回以上発動する場合に無駄になる分も高く評価していたため修正しました。</li>
        </ul>
      </li>
    </ul>

    <h3>2025/04/28</h3>
    <ul>
      <li>ポケモンレベルの上限解放設定が正常に出来ていなかった問題を修正</li>
      <li>げんきチャージが正常に評価されていなかった問題を修正</li>
      <li>ポケモンのレベルを現在の上限より大きい値にして保存すると動作しなくなる問題を修正</li>
    </ul>

    <h3>2025/04/22</h3>
    <ul>
      <li>ダークライをほぼ実装(食材、サブスキルなしは未対応なので適当な値で登録してください)</li>
      <li>ポケモンレベル、レシピレベル、ゆびをふる、ゆめのかけらゲットSの上限解放対応</li>
      <li>リサーチEXPボーナスの上方修正を反映</li>
      <li>げんき回復ボーナスの効果を反映</li>
      <li>
        厳選時のおてつだいボーナスの評価方法を若干変更
        <ul>
          <li>旧：おてつだいボーナスの効果量を設定で指定(デフォルト20%)</li>
          <li>新：他4匹におてつだいボーナスが何匹いる想定か指定(デフォルト3匹)</li>
          <li>おてつだいスピードS/Mしか持っていないポケモンが少しだけ高く評価されるようになりました</li>
        </ul>
      </li>
    </ul>

    <h3>2025/04/13</h3>
    <ul>
      <li>ダークライの新規登録が出来ない問題を修正</li>
      <li>ボックスの表示設定の厳選詳細が有効になっている場合、とくいに関する厳選値が表示されない問題を修正、および「厳選詳細」を「最適でない進化先の厳選値も表示」に変更</li>
    </ul>

    <h3>2025/04/12</h3>
    <ul>
      <li>仮定設定で所持アメ・ゆめのかけらを登録しておくことで、それを使った仮定計算が出来るよう改善</li>
      <li>
        ダークライを仮実装
        <ul>
          <li>専用スキルの実装や、オールとくいの対応にかなり時間がかかる見込みなので、一旦エナチャSで仮置き</li>
          <li>一旦厳選情報計算の対象外にしています</li>
        </ul>
      </li>
      <li>データ＞食材ページに需要判断の参考になる列を追加</li>
    </ul>

    <h3>2025/04/05</h3>
    <ul>
      <li>チームシミュレーションででんせつポケモンが2匹以上入った編成がレコメンドされる不具合を修正</li>
    </ul>

    <h3>2025/04/04</h3>
    <ul>
      <li>育成仮定でレベルが上がっているポケモンのレベル表記に元レベルが表示されていなかった不具合を修正</li>
    </ul>

    <h3>2025/04/02</h3>
    <ul>
      <li>目標レベル周りの情報を更新しても保存されない不具合を修正</li>
    </ul>

    <h3>2025/04/01</h3>
    <ul>
      <li>ボックス画面の一部機能が正常に動作していない不具合の修正</li>
    </ul>

    <h3>2025/03/31</h3>
    <ul>
      <li>クレセリアを追加</li>
      <li>
        クレセリアが来てしまったので作りかけのボックスサマリーをそのまま公開
        <ul>
          <li>きのみ、食材ごとの一番強い個体の表です</li>
          <li>スキルはその形で並べてもあまり意味がなさそうだったので出してません</li>
          <li>そのうち表示周りは任意に指定できるようにして使いやすくしたいです</li>
        </ul>
      </li>
    </ul>

    <h3>2025/03/27</h3>
    <ul>
      <li>ボックスのスキルレベルの表記がおかしくなる時がある問題を修正</li>
      <li>色違いの強調表示がされなくなっていた問題を修正</li>
    </ul>

    <h3>2025/03/27</h3>
    <ul>
      <li>ボックスの固定/除外アイコンの色が変わらない不具合を修正</li>
      <li>ボックスの固定/除外設定がシミュレーションに反映されていない不具合を修正</li>
      <li>ボックス画面でいくつかの列でソートできない問題を修正</li>
    </ul>

    <h3>2025/03/26</h3>
    <ul>
      <li>アップデートに合わせて性格のおてつだいスピード補正を変更</li>
      <li>下振れ考慮の機能を追加</li>
      <li>プログラムを大幅にリファクタリング</li>
    </ul>

    <h3>2025/03/17</h3>
    <ul>
      <li>ムンナ、ムシャーナを追加</li>
    </ul>

    <h3>2025/03/16</h3>
    <ul>
      <li>インポート機能においてメモ情報の取り込みが正常に行われていなかった問題を修正</li>
      <li>
        厳選情報確認画面で内訳を確認する際に銀種前提がオフになっていてもオンの際の計算結果が表示されていた問題を修正
      </li>
    </ul>

    <h3>2025/03/15</h3>
    <ul>
      <li>ワカクサ本島選択時、きのみの画像が大きく表示されてしまう問題を修正</li>
    </ul>

    <h3>2025/03/14</h3>
    <ul>
      <li>育成仮定の設定が開けない不具合を修正</li>
    </ul>

    <h3>2025/03/11</h3>
    <ul>
      <li>一覧画面でのアメ関連の情報を編集しても反映されない不具合の修正</li>
    </ul>

    <h3>2025/03/09</h3>
    <ul>
      <li>厳選設定をより詳細にできるよう改善</li>
    </ul>

    <h3>2025/03/09</h3>
    <ul>
      <li>チームシミュをポップアップからページに移行</li>
      <li>レシピレベルがカンストしている料理を除外するチェックボックスを追加</li>
      <li>ポケモン登録時の食材の入力をABCだけでなく123でも入力できるように改善</li>
    </ul>

    <h3>2025/03/06</h3>
    <ul>
      <li>育成仮定が機能しなくなっていた不具合を修正</li>
    </ul>

    <h3>2025/03/06</h3>
    <ul>
      <li>
        シミュレーション結果から個体の編集ポップアップを開けるよう改善
        <ul>
          <li>ただし再計算の反映には再シミュレーションが必要です</li>
        </ul>
      </li>
      <li>ボックスの各個体にメモ欄を追加(名前の下に表示されます)</li>
      <li>
        Googleスプレッドシートへのエクスポートが失敗した際、アラートが表示されるよう変更
        <ul>
          <li>原因は開発者ツールのコンソールを確認してください。</li>
        </ul>
      </li>
      <li>
        GitHubとDiscordのリンクを追加
        <ul>
          <li>Discordは本ツールの開発、質問などについて扱うために作成しました。とりあえず試験運用します。</li>
        </ul>
      </li>
    </ul>

    <h3>2025/02/11</h3>
    <ul>
      <li>ウパー(パルデアのすがた)、ドオー追加</li>
      <li>ポケモン登録時のローマ字入力でカッコを抜いてもマッチするよう改善</li>
    </ul>

    <h3>2025/02/06</h3>
    <ul>
      <li>アブソルのバランス調整反映</li>
      <li>デザート2種追加</li>
    </ul>

    <h3>2025/01/27</h3>
    <ul>
      <li>スキルコピーでスキルコピーをコピーした時の計算に不具合があったため修正</li>
    </ul>

    <h3>2025/01/26</h3>
    <ul>
      <li>ポケモンのバランス調整、ワシボン、ウォーグル、きのみバーストの反映</li>
      <li>スキルコピーの計算改善</li>
    </ul>

    <h3>2025/01/19</h3>
    <ul>
      <li>イベントボーナスの設定に得意による指定を追加</li>
    </ul>

    <h3>2025/01/13</h3>
    <ul>
      <li>
        へんしん、ものまねを仮実装
        <ul>
          <li>ゆびをふるをコピーした際の計算がややこしすぎるので、ゆびをふるをコピーした場合はエナチャS相当で仮置き(そのうちどうにかする)</li>
        </ul>
      </li>
      <li>料理のレシピレベル設定を改善(3つのうち最も高いものを採用する形式に変更)</li>
    </ul>

    <h3>2025/01/06</h3>
    <ul>
      <li>TSVインポートで固定/除外の設定値が正しく読み込まれず、動作していない不具合を修正</li>
      <li>シミュレーション結果の料理のレシピレベルボーナスの表示が長い小数で表示される不具合を修正</li>
    </ul>

    <h3>2024/12/27</h3>
    <ul>
      <li>イーブイ(ホリデー)、ロコン(アローラのすがた)、キュウコン(アローラのすがた)、パモ、パモット、パーモットを追加</li>
    </ul>

    <h3>2024/12/21</h3>
    <ul>
      <li>一部ポケモンのステータス変更に対応(へんしん、ものまねは未対応)</li>
      <li>
        ボックスの表示設定に「アメ情報」を追加
        <ul>
          <li>所持アメ数がそれなりにある場合、ブーストにx個、通常でy個使えばよいという数値を「最適」として表示しています。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/12/14</h3>
    <ul>
      <li>料理ごとのレシピレベル設定を追加</li>
      <li>キャンチケ使用時の所持数が1.2倍になっていなかった問題を修正</li>
    </ul>

    <h3>2024/11/28</h3>
    <ul>
      <li>ボックスのポケモン新規登録・編集時、食材がすでに入力されている状態で別のポケモンに変更するとその後正常に動作しなくなる問題を修正</li>
    </ul>

    <h3>2024/11/16</h3>
    <ul>
      <li>
        機能追加
        <ul>
          <li>チームシミュレーションに除外フィルタを追加</li>
          <li>
            条件を追加
            <ul>
              <li>手伝い効率：従来の固定機能でヒーラーを固定しなくてもヒーラーの有無を指定できるようになりました。</li>
              <li>睡眠EXPボーナス：睡眠EXP持ちを何匹含めたいか</li>
            </ul>
          </li>
          <li>チームシミュレーションの使用メモリ量を若干改善</li>
        </ul>
      </li>
      <li>
        シミュレーション仕様の修正
        <ul>
          <li>たくわえる(エナジーチャージS)、つきのひかり(げんきチャージS)を実装</li>
          <li>ばけのかわ(きのみバースト)の大成功確率を10%→20%に修正</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/29</h3>
    <ul>
      <li>
        ミミッキュ、ばけのかわ(きのみバースト)を追加
        <ul>
          <li>大成功の確率は一旦10%と仮置きしています</li>
        </ul>
      </li>
      <li>その他ポケモンの調整を反映
        <ul>
          <li>つきのひかりはまだ未対応のため、ブラッキーの評価が少々低めに出てしまう状態です。もうしばらくお待ちください。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/14</h3>
    <ul>
      <li>チームシミュレーションに料理チャンスSの効果が乗っていない不具合を修正</li>
    </ul>

    <h3>2024/10/12</h3>
    <ul>
      <li>ナイトキャップピカチュウの設定を追加</li>
      <li>1週間のチームをシミュレーションした際、食材数の表示が1日分になっている不具合を修正(シミュレーション自体は正常でした)</li>
    </ul>

    <h3>2024/10/11</h3>
    <ul>
      <li>
        フワンテ、フワライドを仮追加
        <ul>
          <li>たくわえる(エナジーチャージS)の詳細がまだ分からないので、エナジーチャージS(ランダム)を仮に設定しています。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/06</h3>
    <ul>
      <li>ポケモン、料理のデータ追加</li>
      <li>厳選テーブルの生成速度を若干改善</li>
    </ul>

    <h3>2024/09/29</h3>
    <ul>
      <li>ゴールド旧発電所のデータを追加</li>
      <li>チームシミュレーション時、料理パワーアップSのレベルが低く足りない場合でも上位料理がレコメンドされる不具合を修正</li>
    </ul>

    <h3>2024/09/18</h3>
    <ul>
      <li>データのページにポケモンごとの食材期待値とスキル期待値を追加</li>
    </ul>

    <h3>2024/09/16</h3>
    <ul>
      <li>厳選情報計算時、未開放のサブスキルにM,Lがありサブスキルの種が与えられないケースの考慮が漏れていたため修正</li>
      <li>
        ボックスのUIを大幅に刷新
        <ul>
          <li>列が多い時ブラウザの動作が重かったので、ページングできるようにしました。</li>
          <li>その他のUIも徐々にブラッシュアップします。</li>
        </ul>
      </li>
      <li>
        厳選情報を生成しなくても使い始められるよう改善
        <ul>
          <li>初期の頃はヒーラーのスコア評価のために必要な処理が今は不要になったので初期設定も不要になりました。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/09/06</h3>
    <ul>
      <li>スイクンを追加</li>
      <li>チームのシミュレーション時におてつだいサポート、おてつだいブーストの評価にスキル回数が掛けられていない問題を修正</li>
    </ul>

    <h3>2024/08/25</h3>
    <ul>
      <li>厳選テーブルのバージョン更新が漏れていたので対応</li>
      <li>仮定設定をオンにするとエラーが発生する不具合を修正</li>
    </ul>

    <h3>2024/08/24</h3>
    <ul>
      <li>厳選の指標にとくい分野のみのものを追加</li>
    </ul>

    <h3>2024/08/19</h3>
    <ul>
      <li>ウパー、ヌオーのデータを追加</li>
      <li>
        ヒーラーの計算をより正確なものに修正
        <ul>
          <li>スキルストックが2の場合の計算がより正確になり、ヒーラー導入時の計算誤差が平均2%ほどになりました。</li>
        </ul>
      </li>
      <li>
        仮定設定を追加
        <ul>
          <li>サブスキルのたね、メインスキルのたねをあげた場合を追加</li>
          <li>厳選度が高い個体のみ仮定で計算する設定を追加</li>
          <li>仮定チェックボックスでまとめてON/OFFできるよう改善</li>
        </ul>
      </li>
    </ul>

    <h3>2024/08/11</h3>
    <ul>
      <li>厳選テーブルのバージョンが古い場合、厳選情報を表示しないよう改善</li>
      <li>ポケモン情報編集時に、ボックスの厳選の状況を追加</li>
      <li>一部列でソートしようとするとエラーが出る不具合を修正</li>
    </ul>

    <h3>2024/07/31</h3>
    <ul>
      <li>ボックスでの概算スコア計算時、ヒーラーの期待計算に不備があったため修正</li>
      <li>睡眠時間がスプレッドシート連携の対象から外れている問題を修正</li>
    </ul>

    <h3>2024/07/30</h3>
    <ul>
      <li>
        シミュレーションの設定で料理を選択可能に変更
        <ul>
          <li>カンストしている料理を避けつつ極力エナジーを稼ぐ計算などに使えます</li>
        </ul>
      </li>
      <li>
        ヒーラーの計算にスキルストックを反映
        <ul>
          <li>深層学習がうまくできておらず、スキルストックがなかった時より高いですが本来より若干低めに出てそうです。</li>
        </ul>
      </li>
      <li>厳選テーブル作成の設定におやすみリボンの時間を追加</li>
      <li>所持ポケモンの設定におやすみリボンの時間を追加</li>
      <li>日別シミュレーションに料理の回数設定を追加</li>
      <li>各種チームシミュレーションで伝説ポケモンを2匹以上組み込む編成が出ないよう改善</li>
    </ul>


    <h3>2024/07/21</h3>
    <ul>
      <li>
        げんき計算を重回帰分析から深層学習に変更
        <ul>
          <li>ちょっと重くなっちゃったかもしれないけど精度がかなり上がりました(誤差が従来に比べて90%減)</li>
          <li>睡眠時間が短い場合の計算もより正確になりました</li>
          <li>睡眠時間/チェック頻度による各々の計算が不要になったので、厳選テーブルの再計算は設定タブで行うことにしました</li>
        </ul>
      </li>
      <li>厳選テーブルタブをやめてデータタブにし、食材・料理・ポケモンの情報を掲載</li>
      <li>厳選テーブル生成時、食材ゲットSが高く評価されすぎないよう設定値を追加</li>
    </ul>

    <h3>2024/07/16</h3>
    <ul>
      <li>新規ポケモン9匹の情報を追加</li>
      <li>ローマ字入力の対応に漏れがあったので追加</li>
    </ul>

    <h3>2024/07/13</h3>
    <ul>
      <li>イベントボーナスの適用がタイプ指定しかできなかったので「全員」を追加</li>
    </ul>

    <h3>2024/07/11</h3>
    <ul>
      <li>料理のレシピを最新のものに更新(これに伴い食材の価値が変わったため要再計算)</li>
    </ul>

    <h3>2024/07/09</h3>
    <ul>
      <li>げんきの計算を最新版のものに修正</li>
      <li>指定レベル・最終進化を仮定してシミュレーションできる設定をボックスに追加</li>
    </ul>

    <h3>2024/07/06</h3>
    <ul>
      <li>週末準備用のシミュレーション機能を追加(まだベータ版です)</li>
    </ul>

    <h3>2024/07/05</h3>
    <ul>
      <li>チームシミュレーションの際、おてつだいサポート、おてつだいブーストで得られるきのみの評価にきのみ率ではなく食材率が使用されていた不具合を修正</li>
      <li>週間シミュレーションのスコアの表示を改善</li>
    </ul>

    <h3>2024/06/26</h3>
    <ul>
      <li>ボックス画面でチームシミュレーションの対象とするか、必須でいれるかの設定を追加</li>
    </ul>

    <h3>2024/06/25</h3>
    <ul>
      <li>一部ポケモンのバランス調整を反映していなかったので修正</li>
      <li>データ更新があった場合、更新を促す表示を追加</li>
      <li>
        入力データの食材に不備があった場合にポケモン一覧がローディング状態となり修正もできなくなる問題を修正
        <ul>
          <li>他のところではまだエラー出るかも</li>
        </ul>
      </li>
      <li>入力データの食材に不備がある場合、ポケモン一覧で強調表示される機能を追加</li>
    </ul>

    <h3>2024/06/23</h3>
    <ul>
      <li>とりあえず公開</li>
    </ul>

  </div>
</template>

<style lang="scss" scoped>
.page {
  padding: 20px;

  .senden {
    // font-weight: ;
    font-size: 110%;
    padding: 1em;

    border: 1px #EEE solid;
    border-radius: 10px;
    box-shadow: 0 3px 5px rgba(0, 0, 0, 0.2);

    a {
      color: #08C;
      font-weight: bold;
    }
  }

  h2 {
    font-size: 24px;
    line-height: 1.4;
    margin-bottom: 0.5em;

    border-bottom: 2px #CCC solid;

    &:not(:first-of-type) {
      margin-top: 1em;
    }
  }
  h3 {
    font-size: 18px;
    line-height: 1.4;
    margin: 0.5em 0 0.25em 0;
    border-bottom: 2px #CCC solid;
  }
  p {
    padding: 5px 0;
  }
}
</style>