<script setup>
import Version from '../models/version';
import config from '../models/config';

config.version.history = Version.HISTORY;
</script>

<template>
  <div class="page">

    <h2>更新履歴</h2>

    <h3>2025/03/27</h3>
    <ul>
      <li>ボックスの固定/除外アイコンの色が変わらない不具合を修正</li>
      <li>ボックスの固定/除外設定がシミュレーションに反映されていない不具合を修正</li>
      <li>ボックス画面でいくつかの列でソートできない問題を修正</li>
    </ul>

    <h3>2025/03/26</h3>
    <ul>
      <li>アップデートに合わせて性格のおてつだいスピード補正を変更</li>
      <li>下振れ考慮の機能を追加</li>
      <li>プログラムを大幅にリファクタリング</li>
    </ul>

    <h3>2025/03/17</h3>
    <ul>
      <li>ムンナ、ムシャーナを追加</li>
    </ul>

    <h3>2025/03/16</h3>
    <ul>
      <li>インポート機能においてメモ情報の取り込みが正常に行われていなかった問題を修正</li>
      <li>
        厳選情報確認画面で内訳を確認する際に銀種前提がオフになっていてもオンの際の計算結果が表示されていた問題を修正
      </li>
    </ul>

    <h3>2025/03/15</h3>
    <ul>
      <li>ワカクサ本島選択時、きのみの画像が大きく表示されてしまう問題を修正</li>
    </ul>

    <h3>2025/03/14</h3>
    <ul>
      <li>育成仮定の設定が開けない不具合を修正</li>
    </ul>

    <h3>2025/03/11</h3>
    <ul>
      <li>一覧画面でのアメ関連の情報を編集しても反映されない不具合の修正</li>
    </ul>

    <h3>2025/03/09</h3>
    <ul>
      <li>厳選設定をより詳細にできるよう改善</li>
    </ul>

    <h3>2025/03/09</h3>
    <ul>
      <li>チームシミュをポップアップからページに移行</li>
      <li>レシピレベルがカンストしている料理を除外するチェックボックスを追加</li>
      <li>ポケモン登録時の食材の入力をABCだけでなく123でも入力できるように改善</li>
    </ul>

    <h3>2025/03/06</h3>
    <ul>
      <li>育成仮定が機能しなくなっていた不具合を修正</li>
    </ul>

    <h3>2025/03/06</h3>
    <ul>
      <li>
        シミュレーション結果から個体の編集ポップアップを開けるよう改善
        <ul>
          <li>ただし再計算の反映には再シミュレーションが必要です</li>
        </ul>
      </li>
      <li>ボックスの各個体にメモ欄を追加(名前の下に表示されます)</li>
      <li>
        Googleスプレッドシートへのエクスポートが失敗した際、アラートが表示されるよう変更
        <ul>
          <li>原因は開発者ツールのコンソールを確認してください。</li>
        </ul>
      </li>
      <li>
        GitHubとDiscordのリンクを追加
        <ul>
          <li>Discordは本ツールの開発、質問などについて扱うために作成しました。とりあえず試験運用します。</li>
        </ul>
      </li>
    </ul>

    <h3>2025/02/11</h3>
    <ul>
      <li>ウパー(パルデアのすがた)、ドオー追加</li>
      <li>ポケモン登録時のローマ字入力でカッコを抜いてもマッチするよう改善</li>
    </ul>

    <h3>2025/02/06</h3>
    <ul>
      <li>アブソルのバランス調整反映</li>
      <li>デザート2種追加</li>
    </ul>

    <h3>2025/01/27</h3>
    <ul>
      <li>スキルコピーでスキルコピーをコピーした時の計算に不具合があったため修正</li>
    </ul>

    <h3>2025/01/26</h3>
    <ul>
      <li>ポケモンのバランス調整、ワシボン、ウォーグル、きのみバーストの反映</li>
      <li>スキルコピーの計算改善</li>
    </ul>

    <h3>2025/01/19</h3>
    <ul>
      <li>イベントボーナスの設定に得意による指定を追加</li>
    </ul>

    <h3>2025/01/13</h3>
    <ul>
      <li>
        へんしん、ものまねを仮実装
        <ul>
          <li>ゆびをふるをコピーした際の計算がややこしすぎるので、ゆびをふるをコピーした場合はエナチャS相当で仮置き(そのうちどうにかする)</li>
        </ul>
      </li>
      <li>料理のレシピレベル設定を改善(3つのうち最も高いものを採用する形式に変更)</li>
    </ul>

    <h3>2025/01/06</h3>
    <ul>
      <li>TSVインポートで固定/除外の設定値が正しく読み込まれず、動作していない不具合を修正</li>
      <li>シミュレーション結果の料理のレシピレベルボーナスの表示が長い小数で表示される不具合を修正</li>
    </ul>

    <h3>2024/12/27</h3>
    <ul>
      <li>イーブイ(ホリデー)、ロコン(アローラのすがた)、キュウコン(アローラのすがた)、パモ、パモット、パーモットを追加</li>
    </ul>

    <h3>2024/12/21</h3>
    <ul>
      <li>一部ポケモンのステータス変更に対応(へんしん、ものまねは未対応)</li>
      <li>
        ボックスの表示設定に「アメ情報」を追加
        <ul>
          <li>所持アメ数がそれなりにある場合、ブーストにx個、通常でy個使えばよいという数値を「最適」として表示しています。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/12/14</h3>
    <ul>
      <li>料理ごとのレシピレベル設定を追加</li>
      <li>キャンチケ使用時の所持数が1.2倍になっていなかった問題を修正</li>
    </ul>

    <h3>2024/11/28</h3>
    <ul>
      <li>ボックスのポケモン新規登録・編集時、食材がすでに入力されている状態で別のポケモンに変更するとその後正常に動作しなくなる問題を修正</li>
    </ul>

    <h3>2024/11/16</h3>
    <ul>
      <li>
        機能追加
        <ul>
          <li>チームシミュレーションに除外フィルタを追加</li>
          <li>
            条件を追加
            <ul>
              <li>手伝い効率：従来の固定機能でヒーラーを固定しなくてもヒーラーの有無を指定できるようになりました。</li>
              <li>睡眠EXPボーナス：睡眠EXP持ちを何匹含めたいか</li>
            </ul>
          </li>
          <li>チームシミュレーションの使用メモリ量を若干改善</li>
        </ul>
      </li>
      <li>
        シミュレーション仕様の修正
        <ul>
          <li>たくわえる(エナジーチャージS)、つきのひかり(げんきチャージS)を実装</li>
          <li>ばけのかわ(きのみバースト)の大成功確率を10%→20%に修正</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/29</h3>
    <ul>
      <li>
        ミミッキュ、ばけのかわ(きのみバースト)を追加
        <ul>
          <li>大成功の確率は一旦10%と仮置きしています</li>
        </ul>
      </li>
      <li>その他ポケモンの調整を反映
        <ul>
          <li>つきのひかりはまだ未対応のため、ブラッキーの評価が少々低めに出てしまう状態です。もうしばらくお待ちください。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/14</h3>
    <ul>
      <li>チームシミュレーションに料理チャンスSの効果が乗っていない不具合を修正</li>
    </ul>

    <h3>2024/10/12</h3>
    <ul>
      <li>ナイトキャップピカチュウの設定を追加</li>
      <li>1週間のチームをシミュレーションした際、食材数の表示が1日分になっている不具合を修正(シミュレーション自体は正常でした)</li>
    </ul>

    <h3>2024/10/11</h3>
    <ul>
      <li>
        フワンテ、フワライドを仮追加
        <ul>
          <li>たくわえる(エナジーチャージS)の詳細がまだ分からないので、エナジーチャージS(ランダム)を仮に設定しています。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/10/06</h3>
    <ul>
      <li>ポケモン、料理のデータ追加</li>
      <li>厳選テーブルの生成速度を若干改善</li>
    </ul>

    <h3>2024/09/29</h3>
    <ul>
      <li>ゴールド旧発電所のデータを追加</li>
      <li>チームシミュレーション時、料理パワーアップSのレベルが低く足りない場合でも上位料理がレコメンドされる不具合を修正</li>
    </ul>

    <h3>2024/09/18</h3>
    <ul>
      <li>データのページにポケモンごとの食材期待値とスキル期待値を追加</li>
    </ul>

    <h3>2024/09/16</h3>
    <ul>
      <li>厳選情報計算時、未開放のサブスキルにM,Lがありサブスキルの種が与えられないケースの考慮が漏れていたため修正</li>
      <li>
        ボックスのUIを大幅に刷新
        <ul>
          <li>列が多い時ブラウザの動作が重かったので、ページングできるようにしました。</li>
          <li>その他のUIも徐々にブラッシュアップします。</li>
        </ul>
      </li>
      <li>
        厳選情報を生成しなくても使い始められるよう改善
        <ul>
          <li>初期の頃はヒーラーのスコア評価のために必要な処理が今は不要になったので初期設定も不要になりました。</li>
        </ul>
      </li>
    </ul>

    <h3>2024/09/06</h3>
    <ul>
      <li>スイクンを追加</li>
      <li>チームのシミュレーション時におてつだいサポート、おてつだいブーストの評価にスキル回数が掛けられていない問題を修正</li>
    </ul>

    <h3>2024/08/25</h3>
    <ul>
      <li>厳選テーブルのバージョン更新が漏れていたので対応</li>
      <li>仮定設定をオンにするとエラーが発生する不具合を修正</li>
    </ul>

    <h3>2024/08/24</h3>
    <ul>
      <li>厳選の指標にとくい分野のみのものを追加</li>
    </ul>

    <h3>2024/08/19</h3>
    <ul>
      <li>ウパー、ヌオーのデータを追加</li>
      <li>
        ヒーラーの計算をより正確なものに修正
        <ul>
          <li>スキルストックが2の場合の計算がより正確になり、ヒーラー導入時の計算誤差が平均2%ほどになりました。</li>
        </ul>
      </li>
      <li>
        仮定設定を追加
        <ul>
          <li>サブスキルのたね、メインスキルのたねをあげた場合を追加</li>
          <li>厳選度が高い個体のみ仮定で計算する設定を追加</li>
          <li>仮定チェックボックスでまとめてON/OFFできるよう改善</li>
        </ul>
      </li>
    </ul>

    <h3>2024/08/11</h3>
    <ul>
      <li>厳選テーブルのバージョンが古い場合、厳選情報を表示しないよう改善</li>
      <li>ポケモン情報編集時に、ボックスの厳選の状況を追加</li>
      <li>一部列でソートしようとするとエラーが出る不具合を修正</li>
    </ul>

    <h3>2024/07/31</h3>
    <ul>
      <li>ボックスでの概算スコア計算時、ヒーラーの期待計算に不備があったため修正</li>
      <li>睡眠時間がスプレッドシート連携の対象から外れている問題を修正</li>
    </ul>

    <h3>2024/07/30</h3>
    <ul>
      <li>
        シミュレーションの設定で料理を選択可能に変更
        <ul>
          <li>カンストしている料理を避けつつ極力エナジーを稼ぐ計算などに使えます</li>
        </ul>
      </li>
      <li>
        ヒーラーの計算にスキルストックを反映
        <ul>
          <li>深層学習がうまくできておらず、スキルストックがなかった時より高いですが本来より若干低めに出てそうです。</li>
        </ul>
      </li>
      <li>厳選テーブル作成の設定におやすみリボンの時間を追加</li>
      <li>所持ポケモンの設定におやすみリボンの時間を追加</li>
      <li>日別シミュレーションに料理の回数設定を追加</li>
      <li>各種チームシミュレーションで伝説ポケモンを2匹以上組み込む編成が出ないよう改善</li>
    </ul>


    <h3>2024/07/21</h3>
    <ul>
      <li>
        げんき計算を重回帰分析から深層学習に変更
        <ul>
          <li>ちょっと重くなっちゃったかもしれないけど精度がかなり上がりました(誤差が従来に比べて90%減)</li>
          <li>睡眠時間が短い場合の計算もより正確になりました</li>
          <li>睡眠時間/チェック頻度による各々の計算が不要になったので、厳選テーブルの再計算は設定タブで行うことにしました</li>
        </ul>
      </li>
      <li>厳選テーブルタブをやめてデータタブにし、食材・料理・ポケモンの情報を掲載</li>
      <li>厳選テーブル生成時、食材ゲットSが高く評価されすぎないよう設定値を追加</li>
    </ul>

    <h3>2024/07/16</h3>
    <ul>
      <li>新規ポケモン9匹の情報を追加</li>
      <li>ローマ字入力の対応に漏れがあったので追加</li>
    </ul>

    <h3>2024/07/13</h3>
    <ul>
      <li>イベントボーナスの適用がタイプ指定しかできなかったので「全員」を追加</li>
    </ul>

    <h3>2024/07/11</h3>
    <ul>
      <li>料理のレシピを最新のものに更新(これに伴い食材の価値が変わったため要再計算)</li>
    </ul>

    <h3>2024/07/09</h3>
    <ul>
      <li>げんきの計算を最新版のものに修正</li>
      <li>指定レベル・最終進化を仮定してシミュレーションできる設定をボックスに追加</li>
    </ul>

    <h3>2024/07/06</h3>
    <ul>
      <li>週末準備用のシミュレーション機能を追加(まだベータ版です)</li>
    </ul>

    <h3>2024/07/05</h3>
    <ul>
      <li>チームシミュレーションの際、おてつだいサポート、おてつだいブーストで得られるきのみの評価にきのみ率ではなく食材率が使用されていた不具合を修正</li>
      <li>週間シミュレーションのスコアの表示を改善</li>
    </ul>

    <h3>2024/06/26</h3>
    <ul>
      <li>ボックス画面でチームシミュレーションの対象とするか、必須でいれるかの設定を追加</li>
    </ul>

    <h3>2024/06/25</h3>
    <ul>
      <li>一部ポケモンのバランス調整を反映していなかったので修正</li>
      <li>データ更新があった場合、更新を促す表示を追加</li>
      <li>
        入力データの食材に不備があった場合にポケモン一覧がローディング状態となり修正もできなくなる問題を修正
        <ul>
          <li>他のところではまだエラー出るかも</li>
        </ul>
      </li>
      <li>入力データの食材に不備がある場合、ポケモン一覧で強調表示される機能を追加</li>
    </ul>

    <h3>2024/06/23</h3>
    <ul>
      <li>とりあえず公開</li>
    </ul>

  </div>
</template>

<style lang="scss" scoped>
.page {
  padding: 20px;

  h2 {
    font-size: 24px;
    line-height: 1.4;
    margin-bottom: 0.5em;

    border-bottom: 2px #CCC solid;

    &:not(:first-of-type) {
      margin-top: 1em;
    }
  }
  h3 {
    font-size: 18px;
    line-height: 1.4;
    margin: 0.5em 0 0.25em 0;
    border-bottom: 2px #CCC solid;
  }
  p {
    padding: 5px 0;
  }
}
</style>